Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གཟུགས་ཀྱི་རང་བཞིན་གང་ཡིན།
en: Then, the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, what is the nature of physical forms?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་ཀྱི་རང་བཞིན་གང་ཡིན།
en: What is the nature of feelings, perceptions, and formative predispositions?

source: རྣམ་པར་ཤེས་པའི་རང་བཞིན་གང་ཡིན།
en: What is the nature of consciousness?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པའི་མཐའི་བར་གྱི་རང་བཞིན་གང་ཡིན།
en: In the same vein, Venerable Su­bhūti, what is the nature of the finality of existence, and so forth?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ། །
en: The venerable Su­bhūti then replied to the venerable Śāradvatī­putra as follows: “Venerable Śāradvatī­putra, the nature of physical forms is non-entity.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ། །
en: Similarly, the nature of feelings, perceptions, formative predispositions, and consciousness is non-entity.

source: ཡང་དག་པའི་མཐའི་བར་གྱི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཇི་ལྟར་གཟུགས་གཟུགས་ཀྱི་རང་བཞིན་དང་བྲལ་བ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་།
en: Venerable Śāradvatī­putra, it is for this reason that one should know that physical forms are without the nature of physical forms, and in the same vein, that [unconditioned phenomena], up to and including the finality of existence, are without the defining characteristics of the finality of existence [and so forth].

source: རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པའི་རང་བཞིན་དང་བྲལ་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པའི་མཐའི་བར་ནི་ཡང་དག་པའི་མཐའི་མཚན་ཉིད་དང་བྲལ་བ། མཚན་ཉིད་ཀྱང་རང་བཞིན་དང་བྲལ་བ་ཡིན་ལ། རང་བཞིན་ཡང་མཚན་ཉིད་དང་བྲལ་བར་རིག་པར་བྱའོ། །
en: One should know that even defining characteristics are without their nature, and their nature is without defining characteristics.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསླབ་པ་འདི་ལ་སློབ་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ།
en: Then, the venerable Śāradvatī­putra asked the venerable Su­bhūti as follows: “Venerable Su­bhūti, will great bodhisattva beings who undertake this training attain emancipation in omniscience?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ། །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: “Yes, Venerable Śāradvatī­putra, it is as you have said!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསླབ་པ་འདི་ལ་སློབ་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: Great bodhisattva beings who undertake this training will attain emancipation in omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་ཤིང་ངེས་པར་འབྱུང་བ་མེད་པའི་ཕྱིར་རོ། །སྨྲས་པ།
en: If you ask why, Venerable Śāradvatī­putra, it is because all things are unborn [in cyclic existence] and unemancipated [in nirvāṇa].”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ཆོས་ཐམས་ཅད་མ་སྐྱེས་ཤིང་ངེས་པར་འབྱུང་བ་མེད་པ་ཡིན། སྨྲས་པ།
en: “Venerable Su­bhūti, why are all things unborn and unemancipated?”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་སྟེ། དེ་ལ་ནི་སྐྱེས་པ་ཡང་མེད་ཅིང་འབྱུང་བ་ཡང་དམིགས་སུ་མེད་དོ། །
en: “Venerable Śāradvatī­putra, physical forms are empty of the nature of physical forms, and in that regard, there is no birth; nor is the emancipation of nirvāṇa apprehensible.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པའི་རང་བཞིན་གྱིས་སྟོང་སྟེ། དེ་ལ་ནི་སྐྱེས་པ་ཡང་མེད་ཅིང་འབྱུང་བ་ཡང་དམིགས་སུ་མེད་དོ། །
en: Similarly, feelings, perceptions, formative predispositions, and consciousness are empty of the nature of consciousness [and the other aggregates], and in that regard, there is no birth; nor is the emancipation of nirvāṇa apprehensible.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པའི་མཐའི་བར་ནི་ཡང་དག་པའི་མཐའི་རང་བཞིན་གྱིས་སྟོང་སྟེ། དེ་ལ་ནི་སྐྱེས་པ་ཡང་མེད་ཅིང་འབྱུང་བ་ཡང་དམིགས་སུ་མེད་དོ། །
en: In the same vein, [all attributes and unconditioned phenomena], up to and including the finality of existence, are empty of the nature of the finality of existence [and so forth], and in that regard, there is no birth; nor is the emancipation of nirvāṇa apprehensible.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་མི་གནས་པའི་ལེའུ་ཞེས་བྱ་སྟེ།
en: This completes the eleventh chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Non-abiding.”

source: བཅུ་གཅིག་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Meditative Stability Chapter 12 The venerable Su­bhūti then said to the Blessed One, “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐབས་ལ་མི་མཁས་པས་གཟུགས་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: If, when great bodhisattva beings practice the transcendent perfection of wisdom, they engage unskillfully with physical forms, then they are merely engaging with mental images, and if they engage in the same manner with feelings, perceptions, formative predispositions, and consciousness, then they are merely engaging with mental images.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །ཡང་གལ་ཏེ་གཟུགས་ལ་རྟག་ཅེས་བགྱི་བའམ། མི་རྟག་ཅེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: Also, if they engage with the notion that physical forms are permanent, or the notion that these are impermanent, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་རྟག་ཅེས་བགྱི་བའམ། མི་རྟག་ཅེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are permanent, or that these are impermanent, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །དེ་བཞིན་དུ་གལ་ཏེ་གཟུགས་ལ་བདེ་ཞེས་བགྱི་བའམ། སྡུག་བསྔལ་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: Similarly, if they engage with the notion that physical forms are imbued with happiness, or that these are imbued with suffering, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་བདེ་ཞེས་བགྱི་བའམ། སྡུག་བསྔལ་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are imbued with happiness, or that these are imbued with suffering, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་བདག་མཆིས་ཞེས་བགྱི་བའམ། བདག་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: “If they engage with the notion that the self exists in physical forms, or that the self does not exist therein, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་བདག་མཆིས་ཞེས་བགྱི་བའམ། བདག་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that the self exists in feelings, perceptions, formative predispositions, and consciousness, or that the self does not exist therein, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་སྟོང་ཞེས་བགྱི་བའམ། མི་སྟོང་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms are empty, or that these are not empty, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་སྟོང་ཞེས་བགྱི་བའམ། མི་སྟོང་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are empty, or that these are not empty, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་མཚན་མ་མཆིས་ཞེས་བགྱི་བའམ། མཚན་མ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན་དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that signs exist in physical forms, or that signs do not exist therein, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མཚན་མ་མཆིས་ཞེས་བགྱི་བའམ། མཚན་མ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that signs exist in feelings, perceptions, formative predispositions, and consciousness, or that signs do not exist therein, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་སྨོན་པ་མཆིས་ཞེས་བགྱི་བའམ། སྨོན་པ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that aspirations exist in physical forms, or that aspirations do not exist therein, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་སྨོན་པ་མཆིས་ཞེས་བགྱི་བའམ། སྨོན་པ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that aspirations exist in feelings, perceptions, formative predispositions, and consciousness, or that aspirations do not exist therein, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་ཞི་ཞེས་བགྱི་བའམ། མ་ཞི་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms are calm, or that these are not calm, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་ཞི་ཞེས་བགྱི་བའམ། མ་ཞི་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are calm, or that these are not calm, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་དབེན་ཞེས་བགྱི་བའམ། མི་དབེན་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms are void, or that these are not void, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་དབེན་ཞེས་བགྱི་བའམ། མི་དབེན་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are void, or that these are not void, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་ཀུན་ནས་ཉོན་མོངས་ཞེས་བགྱི་བའམ། རྣམ་པར་བྱང་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms are afflicted, or that these are purified, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་ཀུན་ནས་ཉོན་མོངས་ཞེས་བགྱི་བའམ། རྣམ་པར་བྱང་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness are afflicted, or that these are purified, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་སྐྱེ་ཞེས་བགྱི་བའམ། མི་སྐྱེ་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms arise, or that these are non-arising, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་སྐྱེ་ཞེས་བགྱི་བའམ། མི་སྐྱེ་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness arise, or that these are non-arising, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་འགག་ཅེས་བགྱི་བའམ། མི་འགག་ཅེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that physical forms cease, or that these are unceasing, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་འགག་ཅེས་བགྱི་བའམ། མི་འགག་ཅེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that feelings, perceptions, formative predispositions, and consciousness cease, or that these are unceasing, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་གཟུགས་ལ་དངོས་པོ་མཆིས་ཞེས་བགྱི་བའམ། དངོས་པོ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the notion that entities exist in physical forms, or that entities do not exist therein, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་དངོས་པོ་མཆིས་ཞེས་བགྱི་བའམ། དངོས་པོ་མ་མཆིས་ཞེས་བགྱི་བར་སྤྱོད་ན།
en: Similarly, if they engage with the notion that entities exist in feelings, perceptions, formative predispositions, and consciousness, or that entities do not exist therein, then they are merely engaging with mental images.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐབས་ལ་མི་མཁས་པས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: “Reverend Lord, when bodhisattvas practice the transcendent perfection of wisdom, if they unskillfully engage with the applications of mindfulness, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: In the same vein, if they engage in the same manner with [the other causal attributes], up to and including the noble eightfold path, then they are merely engaging with mental images.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: If they engage with the ten powers of the tathāgatas, then they are merely engaging with mental images.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་ལ་སྤྱོད་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: In the same vein, if they engage in the same manner with [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, then they are merely engaging with mental images.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྟེ།
en: “Reverend Lord, if great bodhisattva beings who practice the transcendent perfection of wisdom think, ‘I am practicing the transcendent perfection of wisdom.

source: དེ་བསྒོམ་པར་བྱའོ་སྙམ་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །
en: I should cultivate it,’ then they are merely engaging with mental images.

source: གལ་ཏེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་བྱང་ཆུབ་སེམས་དཔའོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའོ་སྙམ་ན།
en: If they think, ‘I am a bodhisattva.

source: དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་སོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: This is a bodhisattva,’ then they are merely engaging with mental images.

source: གང་དེ་ལྟར་སྤྱོད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་པའོ་སྙམ་ན། དེ་ནི་མཚན་མ་ལ་སྤྱོད་པ་ལགས་ཏེ།
en: If bodhisattvas think, “Those who engage in that manner are cultivating the transcendent perfection of wisdom,’ then they are merely engaging with mental images.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་ལ་མི་མཁས་པ་ལགས་པར་རིག་པར་བགྱི་ལགས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། གལ་ཏེ་གཟུགས་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་ལ།
en: One should know this to be the absence of skillful means which great bodhisattva beings might have.”

source: དེ་གཟུགས་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་པ་ན། གཟུགས་ཀྱི་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པ་ཡིན། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: Then the venerable Su­bhūti addressed the venerable Śāradvatī­putra as follows: “Venerable Śāradvatī­putra, when bodhisattvas practice the transcendent perfection of wisdom, if they abide in, cognize, and are intent on physical forms, and similarly, if they abide in, cognize, and are intent on feelings, perceptions, formative predispositions, and consciousness, then, while they are abiding in, cognizing, and intent on physical forms, and similarly, while they are abiding in, cognizing, and intent on feelings, perceptions, formative predispositions, and consciousness, then they are engaging in the conditioning of physical forms, and similarly, they are engaging in the conditioning of feelings, perceptions, formative predispositions, and consciousness.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །གཟུགས་ཀྱི་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པ་ནས་རྣམ་པར་ཤེས་པའི་མངོན་པར་འདུ་བྱེད་པའི་བར་ལ་སྤྱོད་ན་དེ་ནི་ཚེ་རབས་ཕྱི་མ་ལ་སྐྱེ་བ་ལས་ཡོངས་སུ་མི་ཐར་ཞིང་། དེ་ནི་རྒ་བ་ནས་འཁྲུག་པ་དང་། སྡུག་བསྔལ་གྱི་བར་ལས་ཡོངས་སུ་མི་ཐར་བར་ཁོ་བོ་སྨྲའོ། །
en: When they engage in the conditioning of physical forms, and so on, up to the conditioning of consciousness, I say they will not be released from subsequent rebirths, they will be agitated by aging, and so on, and they will not be released from suffering, and so forth.”

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཐབས་ལ་མི་མཁས་པས་མིག་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་བར་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མངོན་པར་ཞེན་ལ་མོས་པར་བྱེད་ན། དེ་ནི་ཚེ་རབས་ཕྱི་མ་ལ་སྡུག་བསྔལ་གྱི་བར་ལས་ཡོངས་སུ་མི་ཐར་བར་ཁོ་བོ་སྨྲའོ། །
en: “Moreover, Śāradvatī­putra, if bodhisattvas who practice the transcendent perfection of wisdom unskillfully abide in, cognize, and are intent on the eyes, and in the same vein, if they abide in, cognize, and are intent on [the other sense organs], up to and including the mental faculty, I say they will not be released from suffering and so forth in subsequent rebirths.

source: དེ་བཞིན་དུ་གལ་ཏེ་གཟུགས་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། གལ་ཏེ་ཆོས་ཀྱི་བར་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་ན། དེ་ནི་ཚེ་རབས་ཕྱི་མ་ལ་སྡུག་བསྔལ་གྱི་བར་ལས་ཡོངས་སུ་མི་ཐར་བར་ཁོ་བོ་སྨྲའོ། །གལ་ཏེ་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དང་།
en: Similarly, if they abide in, cognize, and are intent on sights, and in the same vein, if they abide in, cognize, and are intent on [the other sense objects], up to and including mental phenomena, I say they will not be released from suffering and so forth in subsequent rebirths.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་ན། དེ་ནི་ཚེ་རབས་ཕྱི་མ་ལ་སྡུག་བསྔལ་གྱི་བར་ལས་ཡོངས་སུ་མི་ཐར་བར་ཁོ་བོ་སྨྲའོ། །
en: If they abide in, cognize, and are intent on feelings due to sensory contact that is visually compounded, and so on up to feelings due to sensory contact that is mentally compounded, I say they will not be released from suffering and so forth in subsequent rebirths.

source: གལ་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་པར་བྱེད་ན། དེ་ནི་ཚེ་རབས་ཕྱི་མ་ལ་སྡུག་བསྔལ་གྱི་བར་ལས་ཡོངས་སུ་མི་ཐར་བར་ཁོ་བོ་སྨྲའོ། །
en: If they abide in, cognize, and are intent on the applications of mindfulness and [the other causal attributes], up to and including the noble eightfold path, and likewise, if they abide in, cognize, and are intent on the ten powers of the tathāgatas and [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, I say they will not be released from suffering and so forth in subsequent rebirths.

source: དེ་ནི་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ཡང་མངོན་སུམ་དུ་བྱ་བའི་སྐལ་བ་ཡང་མེད་ན།
en: If they even lack the good fortune to actualize the level of the śrāvakas, or the level of the pratyekabuddhas, how could they possibly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ་དེ་ནི་གནས་མེད་དོ། །
en: That would be impossible!

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་ལ་མི་མཁས་པ་དང་ལྡན་ཞིང་། ཐབས་ལ་མི་མཁས་པར་རིག་པར་བྱའོ། །
en: “Venerable Śāradvatī­putra, when bodhisattvas practice the transcendent perfection of wisdom in that manner they are without skill in means and one should know them to be without skill in means.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐབས་ལ་མཁས་པར་རིག་པར་བྱ་དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Then the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, how should one know that when they are practicing the transcendent perfection of wisdom they do possess skill in means?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། གཟུགས་ལ་མི་སྤྱོད། ཚོར་བ་དང་།
en: The venerable Su­bhūti then replied to the venerable Śāradvatī­putra as follows: “Venerable Śāradvatī­putra, when great bodhisattva beings [skillfully] practice the transcendent perfection of wisdom, they do not engage with physical forms, and they do not engage with feelings, perceptions, formative predispositions, and consciousness.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་སྤྱོད། གཟུགས་ཀྱི་མཚན་མ་ལ་མི་སྤྱོད། ཚོར་བ་དང་།
en: They do not engage with mental images of physical forms, and they do not engage with mental images of feelings, perceptions, formative predispositions, and consciousness.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་མཚན་མ་ལ་མི་སྤྱོད། གཟུགས་རྟག་ཅེས་བྱ་བའམ། མི་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are permanent, or the notion that these are impermanent.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བའམ། མི་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are permanent, or the notion that these are impermanent.

source: གཟུགས་བདེ་ཞེས་བྱ་བའམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are imbued with happiness, or the notion that these are imbued with suffering.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདེ་ཞེས་བྱ་བའམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are imbued with happiness, or the notion that these are imbued with suffering.

source: གཟུགས་བདག་ཡོད་ཅེས་བྱ་བའམ། བདག་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are a self, or the notion that these are not a self.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདག་ཡོད་ཅེས་བྱ་བའམ། བདག་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are a self, or the notion that these are not a self.
